// 1. Sum of digits   =>  Сумма цифр числа 
// (5 digits number  => пятезначное число)
let number = 22222
// 2+2+2+2+2 = 10

// =============================================================
// 2. Sum of letters in a sentence of 3 words and
//    their first and last letters
// RU: Сумма букв в предложении из 3 слов и их 
//    первые и последние буквы
let text = "Hello World JavaScript"
// HoWdJt
// 5 5 10 => 20
// ---------------------------------------------------------------------
// =============================================================
// ---------------------------------------------------------------------
// 3. Is the middle letter of previous task vowel?
// RU: Является ли средняя буква предыдущего задания гласной?
// ---------------------------------------------------------------------
// =============================================================
// ---------------------------------------------------------------------
// 4. Is the first and last letters of previous task NOT vowel?
// RU: Являются ли первая и последняя буквы предыдущего задания НЕ гласными?
// ---------------------------------------------------------------------
// =============================================================
// ---------------------------------------------------------------------
// 5. You have a word that has a length max 5 letters
//    Count how many vowels in that word has
// RU: У вас есть слово, длиной не более 5 букв
//     Посчитайте, сколько гласных букв в этом слове
// ---------------------------------------------------------------------
// =====================================================================
// ---------------------------------------------------------------------
// 6. You have a word that has a length max 10 letters
//    Devide it into two parts and cound constants in right side
// RU: У вас есть слово, длиной не более 10 букв
//     Разделите его на две части и посчитайте согласные буквы в правой части