# SEQUENCEs == Последовательности

# 1. list   ->  []
# 2. tuple  ->  ()
# 3. str    ->  ''
# 4. range  ->  range()
# =================================================
# =================================================

# x = "Hello"
# x = ... # Delete previous value
# print(x)

# x = ['hello', 'world']
# print(x)

# =================================================
# ADDING INTO LISTS
# x = [1, 2, 3]
# - append()   -> добавляет элемент в конец списка

# - insert()   -> добавляет элемент в указанную позицию
# x.insert(2, 4)
# print(x)

# - extend()   -> добавляет элементы из другого списка
# x.extend([4, 5, 6])
# print(x) # [1, 2, 3, 4, 5, 6]
# =================================================
# DELETING FROM LISTS
# 1. remove()   -> удаляет первое вхождение элемента
# 2. pop()      -> удаляет элемент по индексу
# 3. clear()    -> удаляет все элементы
# 4. del        -> удаляет элемент по индексу

# x = [1, 2, 3, 4, 5, 6]
# x.remove(9)

# x.pop(2) # 3

# del x[2] # 3
# =================================================
# ACCESSING ELEMENTS
# x = [1, 2, 3, 4, 5, 6]
# x[5]       =>  By index
# x[-1]      =>  By index
# x[1:3]     =>  By slice
# x[1:5:2]   =>  By slice with step
# x[1:6:-1]  # [2, 3, 4, 5, 6]

# for i in range(len(x)-1, 0, -1):
#     print(x[i])
# ===============================================================================
# ===============================================================================
# ===============================================================================
# ===============================================================================
# ===============================================================================
# ===============================================================================
# ===============================================================================
# range(10)              => range(0, 10)
# list(range(10))        => [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
# range(10, 20)    #     => range(10, 20)
# range(10, 20, 2) #     => range(10, 20, 5)
# list(range(10, 20, 2)) => [10, 12, 14, 16, 18]
# ---------------------------------------------------------
# for (let i=0; i<10; i++) {}
# for num in range(10):
#     print(num)
#     # num = num + 1
#     num += 1
# typeof([])        =>  object
# print(type([]))   =>  <class 'list'>
# ---------------------------------------------------------
# UPDATE
# x_list[...:...] = [...]   =>  updates from ... to ... by [...]
# x_list[index] = '...'
# x[:] = '...'
# ---------------------------------------------------------
# ADD
# [].insert(position, element_to_add) => вставлять
# [].append()  =>  добавит элемент в конец листа
# [].extend()  =>  добавит элементы в конец листа
# ---------------------------------------------------------
# REMOVE
# "..." in x  =>  проверяет есть ли элемент в листе
# [].pop()     =>  удаляет последний элемент
# [].remove()  =>  удаляет элемент по значению
# ---------------------------------------------------------
# COPY
# [].copy() => копирует лист
# x = [1, 2, 3]
# z = x.copy()
# z.append(4)

# print(x)
# print(z)
# ---------------------------------------------------------
# SORT
# [].sort(reverse=True)  => меняет оригинальный лист
# sorted([])             => не меняет оригинальный лист 
#                  и можно присвоить новой переменной
# ---------------------------------------------------------
# unsorted_numbers = [3, 1, 5, 2, 4]
# unsorted_words = ['hello', 'world', 'python', 'java']
# ---------------------------------------------------------
# unsorted_numbers.sort(reverse=True)
# print(unsorted_numbers)
# ---------------------------------------------------------
# unsorted_words.sort(key=len)
# [5, 5, 6, 4]  => [4, 5, 5, 6] => ['java', 'hello', 'world', 'python']
# print(unsorted_words)
# ---------------------------------------------------------
# sorted_words = sorted(unsorted_words, key=len)
# print("sorted_words: ", sorted_words)
# print("unsorted_words: ", unsorted_words)

# ---------------------------------------------------------
# ---------------------------------------------------------
# REVERSE
# [].reverse() =>  меняет оригинальный лист
# reversed([]) =>  не меняет оригинальный лист

# numbers = [1, 2, 3, 4, 5]
# numbers.reverse()
# print(numbers)

# x = reversed(numbers)
# print(list(x))
