# SEQUENCEs == Последовательности

# 1. list   ->  []
# 2. tuple  ->  ()
# 3. str    ->  ''
# 4. range  ->  range()
# =================================================
# =================================================

# x = "Hello"
# x = ... # Delete previous value
# print(x)

# x = ['hello', 'world']
# print(x)

# =================================================
# ADDING INTO LISTS
# x = [1, 2, 3]
# - append()   -> добавляет элемент в конец списка

# - insert()   -> добавляет элемент в указанную позицию
# x.insert(2, 4)
# print(x)

# - extend()   -> добавляет элементы из другого списка
# x.extend([4, 5, 6])
# print(x) # [1, 2, 3, 4, 5, 6]
# =================================================
# DELETING FROM LISTS
# 1. remove()   -> удаляет первое вхождение элемента
# 2. pop()      -> удаляет элемент по индексу
# 3. clear()    -> удаляет все элементы
# 4. del        -> удаляет элемент по индексу

# x = [1, 2, 3, 4, 5, 6]
# x.remove(9)

# x.pop(2) # 3

# del x[2] # 3
# =================================================
# ACCESSING ELEMENTS
# x = [1, 2, 3, 4, 5, 6]
# x[5]       =>  By index
# x[-1]      =>  By index
# x[1:3]     =>  By slice
# x[1:5:2]   =>  By slice with step
# x[1:6:-1]  # [2, 3, 4, 5, 6]

# for i in range(len(x)-1, 0, -1):
#     print(x[i])
# =================================================


